eYSIP-2020/eysip2020-36-eYFi-Mega-ArduinoIDE/e-Yantra-ATmega2560/eYFi-Mega board/eYFi-Mega-Atmega2560/variants/eyfi_mega/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#define NUM_DIGITAL_PINS            84
#define NUM_ANALOG_INPUTS           16
#define analogInputToDigitalPin(p)  ((p < 16) ? (p) + 54 : -1)
#define digitalPinHasPWM(p)         (((p) >= 2 && (p) <= 13) || ((p) >= 44 && (p)<= 46))

#define PIN_SPI_SS    (53)
#define PIN_SPI_MOSI  (51)
#define PIN_SPI_MISO  (50)
#define PIN_SPI_SCK   (52)

#define SS0   (53)
#define SS1   (83)

static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

#define PIN_WIRE_SDA        (20)
#define PIN_WIRE_SCL        (21)


static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;

#define LED_RED 6
#define LED_GREEN 8 
#define LED_BLUE 7

#define USER_SW 72 

#define PIN_A0   (54)
#define PIN_A1   (55)
#define PIN_A2   (56)
#define PIN_A3   (57)
#define PIN_A4   (58)
#define PIN_A5   (59)
#define PIN_A6   (60)
#define PIN_A7   (61)
#define PIN_A8   (62)
#define PIN_A9   (63)
#define PIN_A10  (64)
#define PIN_A11  (65)
#define PIN_A12  (66)
#define PIN_A13  (67)
#define PIN_A14  (68)
#define PIN_A15  (69)

static const uint8_t A0 = PIN_A0;
static const uint8_t A1 = PIN_A1;
static const uint8_t A2 = PIN_A2;
static const uint8_t A3 = PIN_A3;
static const uint8_t A4 = PIN_A4;
static const uint8_t A5 = PIN_A5;
static const uint8_t A6 = PIN_A6;
static const uint8_t A7 = PIN_A7;
static const uint8_t A8 = PIN_A8;
static const uint8_t A9 = PIN_A9;
static const uint8_t A10 = PIN_A10;
static const uint8_t A11 = PIN_A11;
static const uint8_t A12 = PIN_A12;
static const uint8_t A13 = PIN_A13;
static const uint8_t A14 = PIN_A14;
static const uint8_t A15 = PIN_A15;

static const uint8_t ADC0 = PIN_A0;
static const uint8_t ADC1 = PIN_A1;
static const uint8_t ADC2 = PIN_A2;
static const uint8_t ADC3 = PIN_A3;
static const uint8_t ADC4 = PIN_A4;
static const uint8_t ADC5 = PIN_A5;
static const uint8_t ADC6 = PIN_A6;
static const uint8_t ADC7 = PIN_A7;
static const uint8_t ADC8 = PIN_A8;
static const uint8_t ADC9 = PIN_A9;
static const uint8_t ADC10 = PIN_A10;
static const uint8_t ADC11 = PIN_A11;
static const uint8_t ADC12 = PIN_A12;
static const uint8_t ADC13 = PIN_A13;
static const uint8_t ADC14 = PIN_A14;
static const uint8_t ADC15 = PIN_A15;

#define pe0 0
#define pe1 1
#define pe4 2
#define pe5 3
#define pg5 4
#define pe3 5
#define ph3 6
#define ph4 7
#define ph5 8
#define ph6 9
#define pb4 10
#define pb5 11
#define pb6 12
#define pb7 13
#define pj1 14
#define pj0 15
#define ph1 16
#define ph0 17
#define pd3 18
#define pd2 19
#define pd1 20
#define pd0 21
#define pa0 22
#define pa1 23
#define pa2 24
#define pa3 25 
#define pa4 26
#define pa5 27
#define pa6 28
#define pa7 29
#define pc7 30
#define pc6 31
#define pc5 32
#define pc4 33
#define pc3 34
#define pc2 35
#define pc1 36
#define pc0 37
#define pd7 38
#define pg2 39
#define pg1 40
#define pg0 41
#define pl7 42
#define pl6 43
#define pl5 44
#define pl4 45
#define pl3 46
#define pl2 47
#define pl1 48
#define pl0 49
#define pb3 50
#define pb2 51
#define pb1 52
#define pb0 53
#define pf0 54
#define pf1 55
#define pf2 56
#define pf3 57
#define pf4 58
#define pf5 59
#define pf6 60
#define pf7 61
#define pk0 62
#define pk1 63
#define pk2 64
#define pk3 65
#define pk4 66
#define pk5 67
#define pk6 68
#define pk7 69
#define pe2 70
#define pe6 71
#define pe7 72
#define ph2 73
#define ph7 74
#define pd4 75
#define pd5 76
#define pd6 77
#define pj2 78
#define pj3 79
#define pj4 80
#define pj5 81
#define pj6 82
#define pj7 83

#define int4 2
#define int5 3
#define int6 71
#define int7 72

#define RX2 17
#define TX2 16
#define RX3 15
#define TX3 14
#define RX1 19
#define TX1 18

#define oc0a 13
#define oc0b 4
#define oc1a 11
#define oc1b 12
#define oc1c 13
#define oc2a 10
#define oc2b 9
#define oc3a 5
#define oc4a 6
#define oc4b 7
#define oc4c 8
#define oc5a 46
#define oc5b 45
#define oc5c 44

// A majority of the pins are NOT PCINTs, SO BE WARNED (i.e. you cannot use them as receive pins)
// Only pins available for RECEIVE (TRANSMIT can be on any pin):
// (I've deliberately left out pin mapping to the Hardware USARTs - seems senseless to me)
// Pins: 10, 11, 12, 13,  50, 51, 52, 53,  62, 63, 64, 65, 66, 67, 68, 69, 0, 78, 79, 80, 81, 82, 14, 15

#define digitalPinToPCICR(p)    ( (((p) >= 10) && ((p) <= 15)) || \
								  ((p) == 0) || \
								  (((p) >= 78) && ((p) <= 82)) || \
                                  (((p) >= 50) && ((p) <= 53)) || \
                                  (((p) >= 62) && ((p) <= 69)) ? (&PCICR) : ((uint8_t *)0) )

#define digitalPinToPCICRbit(p) ( (((p) >= 10) && ((p) <= 13)) || (((p) >= 50) && ((p) <= 53)) ? 0 : \
								( ((p) == 0) || (((p) >= 78) && ((p) <= 82)) || (((p) >= 14) && ((p) <= 15)) ? 1 : \
                                ( (((p) >= 62) && ((p) <= 69)) ? 2 : \
                                0 ) )

#define digitalPinToPCMSK(p)    ( (((p) >= 10) && ((p) <= 13)) || (((p) >= 50) && ((p) <= 53)) ? (&PCMSK0) : \
								( ((p) == 0) || (((p) >= 78) && ((p) <= 82)) || (((p) >= 14) && ((p) <= 15)) ? (&PCMSK1) : \
                                ( (((p) >= 62) && ((p) <= 69)) ? (&PCMSK2) : \
                                ((uint8_t *)0) ) )

#define digitalPinToPCMSKbit(p) ( (((p) >= 10) && ((p) <= 13)) ? ((p) - 6) : \
                                ( ((p) == 50) ? 3 : \
                                ( ((p) == 51) ? 2 : \
                                ( ((p) == 52) ? 1 : \
                                ( ((p) == 53) ? 0 : \
                                ( ((p) == 0) ? 0 : \
                                ( ((p) == 14) ? 2 : \
                                ( ((p) == 15) ? 1 : \
                                ( (((p) >= 78) && ((p) <= 82)) ? ((p) - 75) : \
                                ( (((p) >= 62) && ((p) <= 69)) ? ((p) - 62) : \
                                0 ) ) ) ) ) ) ) ) ) )

#define digitalPinToInterrupt(p) ((p) == 2 ? 0 : ((p) == 3 ? 1 : ((p) == 71 ? 6 : ((p) == 72 ? 7 : ((p) >= 18 && (p) <= 21 ? 23 - (p) : NOT_AN_INTERRUPT)))))

#ifdef ARDUINO_MAIN

const uint16_t PROGMEM port_to_mode_PGM[] = {
	NOT_A_PORT,
	(uint16_t) &DDRA,
	(uint16_t) &DDRB,
	(uint16_t) &DDRC,
	(uint16_t) &DDRD,
	(uint16_t) &DDRE,
	(uint16_t) &DDRF,
	(uint16_t) &DDRG,
	(uint16_t) &DDRH,
	NOT_A_PORT,
	(uint16_t) &DDRJ,
	(uint16_t) &DDRK,
	(uint16_t) &DDRL,
};

const uint16_t PROGMEM port_to_output_PGM[] = {
	NOT_A_PORT,
	(uint16_t) &PORTA,
	(uint16_t) &PORTB,
	(uint16_t) &PORTC,
	(uint16_t) &PORTD,
	(uint16_t) &PORTE,
	(uint16_t) &PORTF,
	(uint16_t) &PORTG,
	(uint16_t) &PORTH,
	NOT_A_PORT,
	(uint16_t) &PORTJ,
	(uint16_t) &PORTK,
	(uint16_t) &PORTL,
};

const uint16_t PROGMEM port_to_input_PGM[] = {
	NOT_A_PIN,
	(uint16_t) &PINA,
	(uint16_t) &PINB,
	(uint16_t) &PINC,
	(uint16_t) &PIND,
	(uint16_t) &PINE,
	(uint16_t) &PINF,
	(uint16_t) &PING,
	(uint16_t) &PINH,
	NOT_A_PIN,
	(uint16_t) &PINJ,
	(uint16_t) &PINK,
	(uint16_t) &PINL,
};

